
# bashシェルスクリプトで汎用的に使用できるいろいろな関数
# `source {このファイル}.sh`

#########################################
# 標準エラー出力
#########################################
err_echo () {
    echo "${1}" 1>&2
}

#########################################
# 設定ファイル書き換える関数
# 実行例: override_ini_param {ini_path} {section} {key} {value}
# ＜注意＞
# 配列パラメータはこれで書き換えることはできないので注意
#########################################
override_ini_param() {
    sed -i -e "/^ *\[${2}\] *$/,/^\s*${3}/ s#^\s*${3}\s*=.*\$#${3}=\"${4}\"#g" ${1}
}

#########################################
# iniの設定をロードする
# 実行例: load_ini_param {ini_path} {section}
#########################################
load_ini_param() {
    # ini parser
    eval `sed -e 's/[[:space:]]*\=[[:space:]]*/=/g' \
        -e 's/;.*$//' \
        -e 's/[[:space:]]*$//' \
        -e 's/^[[:space:]]*//' \
        -e "s/^\(.*\)=\([^\"']*\)$/\1=\"\2\"/" < \
    ${1} | sed -n -e "/^\[${2}\]/,/^\s*\[/{/^[^;].*\=.*/p;}"`
}


#########################################
# 指定したパスの絶対パスを取得する
#########################################
abspath() {
    echo "$(cd $(dirname $1) && pwd)/$(basename $1)"
}

